[
  {
    "id": "2019-08-29-ideas-1",
    "quote": "\"You know yourself mostly by your thoughts.\n\nEveryone else in the world knows you only by your actions.\n\nRemember this when you feel misunderstood. You have to do or say something for others to know how you feel.\"",
    "intro": "On being misunderstood",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "James Clear",
    "date": "2019-08-29",
    "section": "Ideas",
    "explanation": "A reminder that internal thoughts are invisible to others - communication through actions and words is essential for understanding"
  },
  {
    "id": "2019-08-29-ideas-2",
    "quote": "\"A strategy for thinking clearly: Rather than trying to be right, assume you are wrong and try to be less wrong.\n\nTrying to be right has a tendency to devolve into protecting your beliefs.\n\nTrying to be less wrong has a tendency to prompt more questions and intellectual humility.\"",
    "intro": "On intellectual humility",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "James Clear",
    "date": "2019-08-29",
    "section": "Ideas",
    "explanation": "A mental model that encourages continuous learning and questioning rather than defending fixed positions"
  },
  {
    "id": "2019-08-29-ideas-3",
    "quote": "\"Habits will form whether you want them or not.\n\nWhatever you repeat, you reinforce.\"",
    "intro": "On habit formation",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "James Clear",
    "date": "2019-08-29",
    "section": "Ideas",
    "explanation": "A fundamental truth about habits - they form automatically through repetition, whether intentional or not"
  },
  {
    "id": "2019-08-22-ideas-1",
    "quote": "\"Qualities that lead to increasing intelligence:\n\n1. The curiosity to experiment and explore.\n2. The honesty to observe the world as it is, not as you wish it to be.\n3. The humility to kill your favorite ideas when you learn something new.\n4. The consistency to repeat this cycle for life.\"",
    "intro": "On increasing intelligence",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "James Clear",
    "date": "2019-08-22",
    "section": "Ideas",
    "explanation": "A framework for developing intelligence through curiosity, honesty, humility, and consistent learning cycles"
  },
  {
    "id": "2019-08-22-ideas-2",
    "quote": "\"The most effective networking strategy I've found has nothing to do with conferences, cocktail hours, cold emails, or any of the common ideas you hear.\n\n1) Do interesting things.\n2) Share them publicly.\n\nRepeat those two strategies and you'll become a magnet. Like-minded people will come to you.\"",
    "intro": "On networking",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "James Clear",
    "date": "2019-08-22",
    "section": "Ideas",
    "explanation": "A simple but powerful networking approach focused on creating value and sharing it publicly"
  },
  {
    "id": "2019-08-22-ideas-3",
    "quote": "\"In the long-run (and often in the short-run), your willpower will never beat your environment.\"",
    "intro": "On willpower vs. environment",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "James Clear",
    "date": "2019-08-22",
    "section": "Ideas",
    "explanation": "A reminder that environmental design is more powerful than relying on willpower alone"
  },
  {
    "id": "2019-08-15-ideas-1",
    "quote": "\"Mastery requires both impatience and patience.\n\nThe impatience to have a bias toward action, to not waste time, and to work with a sense of urgency each day.\n\nThe patience to delay gratification, to wait for your actions to accumulate, and to trust the process.\"",
    "intro": "On mastery",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "James Clear",
    "date": "2019-08-15",
    "section": "Ideas",
    "explanation": "A reflection on the dual nature of mastery - requiring both urgency in daily action and patience for long-term results"
  },
  {
    "id": "2019-08-15-ideas-2",
    "quote": "\"When making plans, think big.\n\nWhen making progress, think small.\"",
    "intro": "On planning vs. progress",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "James Clear",
    "date": "2019-08-15",
    "section": "Ideas",
    "explanation": "Strategic advice on balancing big-picture planning with small, incremental progress steps"
  },
  {
    "id": "2019-08-15-ideas-3",
    "quote": "\"A simple strategy that will save you so many headaches: don't care about winning trivial arguments.\n\nDid someone say something you don't agree with? Smile, nod, and move on to more important things.\n\nLife is short. Learning to not care about having the last word will save you so much time.\"",
    "intro": "On avoiding trivial arguments",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "James Clear",
    "date": "2019-08-15",
    "section": "Ideas",
    "explanation": "Practical advice on conserving energy by avoiding unnecessary conflicts and focusing on what truly matters"
  },
  {
    "id": "2019-08-08-ideas-1",
    "quote": "Over 107 billion people have lived throughout history. (There are roughly 7.7 billion people alive right now.)\n\nOver the centuries, these billions of people have tried things, failed, learned, and tried differently. Sometimes, they found new solutions. And when you are born, you get to inherit the insights they learned by trial and error.\n\nThe cumulative lessons of those 107 billion people have been passed down to you. It is the greatest gift you will ever receive. We are smart not because of our individual genius, but because of our collective knowledge.\n\nAs the historian Niall Ferguson noted, \"The dead outnumber the living fourteen to one, and we ignore the accumulated experience of such a huge majority of mankind at our peril.\"",
    "intro": "On the lessons of history",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
  },
  {
    "id": "2019-08-08-ideas-2",
    "quote": "\"Life is short.\n\nAnd if life is short, then moving quickly matters. Launch the product. Write the book. Ask the question. Take the chance.\nBe thoughtful, but get moving.\"",
    "intro": "On taking action",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "A call to action emphasizing the importance of moving quickly while remaining thoughtful"
  },
  {
    "id": "2019-08-08-ideas-3",
    "quote": "\"Start now. Optimize later.\n\nAn imperfect start can always be improved, but obsessing over a perfect plan will never take you anywhere on its own.\"",
    "intro": "On imperfect starts",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "Encouragement to begin with what you have rather than waiting for perfection"
  }
]
