[
  {
    "id": "2019-08-08-1",
    "quote": "Over 107 billion people have lived throughout history. (There are roughly 7.7 billion people alive right now.)\n\nOver the centuries, these billions of people have tried things, failed, learned, and tried differently. Sometimes, they found new solutions. And when you are born, you get to inherit the insights they learned by trial and error.\n\nThe cumulative lessons of those 107 billion people have been passed down to you. It is the greatest gift you will ever receive. We are smart not because of our individual genius, but because of our collective knowledge.\n\nAs the historian Niall Ferguson noted, \"The dead outnumber the living fourteen to one, and we ignore the accumulated experience of such a huge majority of mankind at our peril.\"",
    "intro": "On the lessons of history",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "A reflection on how we inherit collective wisdom from all who came before us",
    "category": "wisdom",
    "tags": [
      "history",
      "collective wisdom",
      "learning",
      "inheritance",
      "Niall Ferguson"
    ]
  },
  {
    "id": "2019-08-08-2",
    "quote": "\"Life is short.\n\nAnd if life is short, then moving quickly matters. Launch the product. Write the book. Ask the question. Take the chance.\nBe thoughtful, but get moving.\"",
    "intro": "On taking action",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "A call to action emphasizing the importance of moving quickly while remaining thoughtful",
    "category": "action",
    "tags": ["action", "urgency", "productivity", "timing", "quotes"]
  },
  {
    "id": "2019-08-08-3",
    "quote": "\"Start now. Optimize later.\n\nAn imperfect start can always be improved, but obsessing over a perfect plan will never take you anywhere on its own.\"",
    "intro": "On imperfect starts",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "Encouragement to begin with what you have rather than waiting for perfection",
    "category": "mindset",
    "tags": ["imperfection", "action", "planning", "progress", "quotes"]
  }
]
