[
  {
    "id": "2019-10-24-ideas-1",
    "quote": "\"Habits that have a high rate of return in life:\n\n– sleeping 8+ hours each day\n– lifting weights 3x week\n– going for a walk each day\n– saving at least 10 percent of your income\n– reading every day\n– drinking more water and less of everything else\n– leaving your phone in another room while you work\"",
    "intro": "On high-return habits",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-24-2019",
    "author": "James Clear",
    "date": "2019-10-24",
    "section": "Ideas",
    "explanation": "A curated list of foundational habits that provide disproportionate benefits relative to the effort required, covering physical health, financial security, mental development, and productivity"
  },
  {
    "id": "2019-10-24-ideas-2",
    "quote": "\"A good choice may go unrewarded for a long time.\n\nThe best choices tend to provide exponential returns and a hallmark of any compounding process is that the greatest rewards are delayed. Things don't really take off until years later.\n\nKeep working. Be patient.\"",
    "intro": "On delayed rewards of good choices",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-24-2019",
    "author": "James Clear",
    "date": "2019-10-24",
    "section": "Ideas",
    "explanation": "A reminder about the nature of compounding processes and the importance of patience when making good choices, as the greatest benefits often emerge years later"
  },
  {
    "id": "2019-10-24-ideas-3",
    "quote": "\"When you say no, you are only saying no to one option.\n\nWhen you say yes, you are saying no to every other option.\n\nNo is a decision.\n\nYes is a responsibility.\n\nBe careful what (and who) you say yes to. It will shape your day, your career, your family, your life.\"",
    "intro": "On the power of yes and no",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-24-2019",
    "author": "James Clear",
    "date": "2019-10-24",
    "section": "Ideas",
    "explanation": "A profound reframing of yes/no decisions that shows how saying yes to one thing means saying no to everything else, emphasizing the responsibility that comes with commitment"
  },
  {
    "id": "2019-10-17-ideas-1",
    "quote": "\"The idea that 'change is hard' is one of the biggest myths about human behavior.\n\nThe truth is, you change effortlessly and all the time. The primary job of the brain is to adjust your behavior based on the environment.\n\nDesign a better environment. Change will happen naturally.\"",
    "intro": "On the myth of change being hard",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-17-2019",
    "author": "James Clear",
    "date": "2019-10-17",
    "section": "Ideas",
    "explanation": "A counterintuitive insight that challenges the common belief about change, emphasizing that environmental design is more effective than willpower for behavior modification"
  },
  {
    "id": "2019-10-17-ideas-2",
    "quote": "\"A simple way to ensure you are focused on what matters:\n\nImagine everything gets wiped. You inherit no tasks or responsibilities from your past or present. Then, add back only what you miss.\n\nChoose what to add to a blank slate, not what to keep from a full plate.\"",
    "intro": "On focusing on what matters",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-17-2019",
    "author": "James Clear",
    "date": "2019-10-17",
    "section": "Ideas",
    "explanation": "A mental model for prioritization that flips the traditional approach - instead of deciding what to remove, start fresh and only add back what truly matters"
  },
  {
    "id": "2019-10-17-ideas-3",
    "quote": "\"Having good health isn't everything, but not having it is.\n\nHaving money isn't everything, but not having it is.\n\nYou don't need 6-pack abs or a million dollars to be happy, but it is worth learning the fundamentals of fitness and finance.\n\nThey bring a margin of safety.\"",
    "intro": "On the margin of safety",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-17-2019",
    "author": "James Clear",
    "date": "2019-10-17",
    "section": "Ideas",
    "explanation": "A balanced perspective on health and wealth that emphasizes the importance of fundamentals and the security they provide, rather than pursuing extremes"
  },
  {
    "id": "2019-10-10-ideas-1",
    "quote": "\"Gut reactions are usually very wrong or very right.\n\nThey tend to be wrong when they are based purely on emotion and in domains where you lack experience. They tend to be right when they are rooted in deep understanding and well-developed taste.\n\nTrust your gut when you have the experience to back it up.\"",
    "intro": "On when to trust your gut",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-10-2019",
    "author": "James Clear",
    "date": "2019-10-10",
    "section": "Ideas",
    "explanation": "A nuanced perspective on intuition that distinguishes between emotional reactions and experienced-based instincts, helping readers understand when to trust their gut feelings"
  },
  {
    "id": "2019-10-10-ideas-2",
    "quote": "\"Negotiation Tips\n\n-You want leverage.\n-The person who creates more value has leverage.\n-The person who can walk away has leverage.\n-The person who is irreplaceable has leverage.\n-The person who has a second option has leverage.\n-The person who knows the numbers has leverage.\n-The person who everyone likes and wants to work with has leverage.\n-The person who asks for more, gets more.\n\nAnd finally, most negotiations are not one-time affairs. The person people continue to like at the end of this negotiation is in a better position for the next one.\"",
    "intro": "On negotiation leverage",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-10-2019",
    "author": "James Clear",
    "date": "2019-10-10",
    "section": "Ideas",
    "explanation": "A comprehensive framework for understanding and building leverage in negotiations, emphasizing that relationships and reputation matter beyond individual deals"
  },
  {
    "id": "2019-10-10-ideas-3",
    "quote": "\"The fact that you go to the gym even though you don't 'need' to… is why you don't need to.\n\nThe fact that you save when you could spend… is why you have money to spend.\n\nYour habits create your strength.\"",
    "intro": "On how habits create strength",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-10-2019",
    "author": "James Clear",
    "date": "2019-10-10",
    "section": "Ideas",
    "explanation": "A powerful insight showing how proactive habits in the present create the very conditions that make those habits seem unnecessary later - demonstrating the compound effect of consistent behavior"
  },
  {
    "id": "2019-10-03-ideas-1",
    "quote": "\"The costs of your good habits are in the present.\n\nThe costs of your bad habits are in the future.\"",
    "intro": "On the timing of habit costs",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-3-2019",
    "author": "James Clear",
    "date": "2019-10-03",
    "section": "Ideas",
    "explanation": "A simple but powerful insight about the temporal nature of habit costs - good habits require immediate effort while bad habits defer consequences to the future"
  },
  {
    "id": "2019-10-03-ideas-2",
    "quote": "\"Why focus on the process when the world is outcome driven? Don't results matter?\n\nYes, results do matter. But if you optimize for the outcome, you win one time.\n\nIf you optimize for a process that leads to great outcomes, you can win again and again.\"",
    "intro": "On process vs. outcome optimization",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-3-2019",
    "author": "James Clear",
    "date": "2019-10-03",
    "section": "Ideas",
    "explanation": "A strategic perspective showing that while outcomes matter, building sustainable processes creates repeatable success rather than one-time wins"
  },
  {
    "id": "2019-10-03-ideas-3",
    "quote": "\"Major life changes—moving to a new city, starting a new job, ending a relationship, getting married, having kids, etc.—will often make life harder for the first 100 days before improving.\n\nThis is not always true, but it's a nice reminder that experiencing early struggle doesn't mean it was a bad choice.\"",
    "intro": "On the 100-day rule of major changes",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-3-2019",
    "author": "James Clear",
    "date": "2019-10-03",
    "section": "Ideas",
    "explanation": "A comforting framework for navigating major life transitions, reminding us that initial difficulty is often part of the adjustment process, not a sign of poor decision-making"
  },
  {
    "id": "2019-09-26-ideas-1",
    "quote": "\"Optimists win in the long-run because their miscalculation of how long it will take or how likely it is to succeed motivates them to give it a try.\n\nIf you knew how hard it would be and how long it would take in the beginning then you might not try in the first place.\n\nYou can't guarantee success, but you can guarantee failure: never try.\"",
    "intro": "On the optimism advantage",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-26-2019",
    "author": "James Clear",
    "date": "2019-09-26",
    "section": "Ideas",
    "explanation": "A counterintuitive insight that optimistic miscalculations can actually be beneficial, as they provide the motivation to attempt difficult things that might otherwise seem too daunting"
  },
  {
    "id": "2019-09-26-ideas-2",
    "quote": "\"Your body adapts to what you eat.\n\nYour mind adapts to what you consume.\n\nYour soul adapts to what you love.\n\nWhat you feed yourself today is who you become tomorrow.\"",
    "intro": "On what shapes your future self",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-26-2019",
    "author": "James Clear",
    "date": "2019-09-26",
    "section": "Ideas",
    "explanation": "A holistic framework showing how your daily inputs across physical, mental, and spiritual dimensions gradually transform you into the person you'll become"
  },
  {
    "id": "2019-09-26-ideas-3",
    "quote": "\"One of the most underrated career skills that isn't really taught anywhere is editing your own writing.\n\nGreat writing is actually re-writing. Simplifying paragraphs. Clarifying key points. Double-checking for typos.\n\nGood writing will impress in any job.\"",
    "intro": "On the power of self-editing",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-26-2019",
    "author": "James Clear",
    "date": "2019-09-26",
    "section": "Ideas",
    "explanation": "A practical career insight highlighting that the ability to refine and polish your own work is a valuable skill that can set you apart in any professional setting"
  },
  {
    "id": "2019-09-12-ideas-1",
    "quote": "\"Your 1st blog post will be bad, but your 1000th will be great.\n\nYour 1st workout will be weak, but your 1000th will be strong.\n\nYour 1st meditation will be scattered, but your 1000th will be focused.\n\nPut in your reps.\"",
    "intro": "On the power of repetition",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-12-2019",
    "author": "James Clear",
    "date": "2019-09-12",
    "section": "Ideas",
    "explanation": "A reminder that excellence comes from consistent practice - the gap between your first and thousandth attempt is what makes mastery"
  },
  {
    "id": "2019-09-12-ideas-2",
    "quote": "\"Make mistakes of ambition and not mistakes of sloth.\"\n—Machiavelli\n\n\"Mistakes of ambition:\n-failing on a big goal\n-creating something nobody wants\n\nMistakes of sloth:\n-not attempting a big goal\n-consuming instead of creating\n\nMistakes of ambition teach. Mistakes of sloth comfort.\"",
    "intro": "On choosing the right mistakes",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-12-2019",
    "author": "James Clear",
    "date": "2019-09-12",
    "section": "Ideas",
    "explanation": "Building on Machiavelli's wisdom to distinguish between failures that teach (ambition) and those that merely comfort (sloth)"
  },
  {
    "id": "2019-09-12-ideas-3",
    "quote": "It's crazy how often I feel like I need to resolve some big problem in my life when all I really need is one of the following:\n\n1. A glass of water\n2. A 10-minute walk outside\n3. A good night of sleep\n\nThree simple things that resolve many of the stresses and anxieties of daily life.",
    "intro": "On simple solutions to stress",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-12-2019",
    "author": "James Clear",
    "date": "2019-09-12",
    "section": "Ideas",
    "explanation": "A reminder that many perceived problems are actually basic physiological needs - hydration, movement, and rest"
  },
  {
    "id": "2019-09-05-ideas-1",
    "quote": "\"A problem solving strategy:\n\nIf you're stuck, shift up a level or two (think bigger picture) or down a level or two (think finer details). Many problems are solvable at a different level.\n\nThis works for strategy too. You'll often find a better opportunity at a different level.\"",
    "intro": "On problem solving",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-5-2019",
    "author": "James Clear",
    "date": "2019-09-05",
    "section": "Ideas",
    "explanation": "A mental model for getting unstuck by shifting perspective - either zooming out to see the bigger picture or zooming in to examine finer details"
  },
  {
    "id": "2019-09-05-ideas-2",
    "quote": "\"Practice is the price you pay today to be better tomorrow.\"",
    "intro": "On the value of practice",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-5-2019",
    "author": "James Clear",
    "date": "2019-09-05",
    "section": "Ideas",
    "explanation": "A concise reminder that improvement requires consistent effort and investment in the present"
  },
  {
    "id": "2019-09-05-ideas-3",
    "quote": "\"Merely believing you deserve something doesn't make it a reality… but believing you don't deserve something will prevent you from trying.\n\nMost people are capable of more than they believe. Confidence won't automatically get you results, but self-doubt sets your ceiling.\"",
    "intro": "On self-belief and limitations",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-5-2019",
    "author": "James Clear",
    "date": "2019-09-05",
    "section": "Ideas",
    "explanation": "A balanced perspective on confidence - it doesn't guarantee success, but lack of it guarantees a lower ceiling"
  },
  {
    "id": "2019-08-29-ideas-1",
    "quote": "\"You know yourself mostly by your thoughts.\n\nEveryone else in the world knows you only by your actions.\n\nRemember this when you feel misunderstood. You have to do or say something for others to know how you feel.\"",
    "intro": "On being misunderstood",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "James Clear",
    "date": "2019-08-29",
    "section": "Ideas",
    "explanation": "A reminder that internal thoughts are invisible to others - communication through actions and words is essential for understanding"
  },
  {
    "id": "2019-08-29-ideas-2",
    "quote": "\"A strategy for thinking clearly: Rather than trying to be right, assume you are wrong and try to be less wrong.\n\nTrying to be right has a tendency to devolve into protecting your beliefs.\n\nTrying to be less wrong has a tendency to prompt more questions and intellectual humility.\"",
    "intro": "On intellectual humility",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "James Clear",
    "date": "2019-08-29",
    "section": "Ideas",
    "explanation": "A mental model that encourages continuous learning and questioning rather than defending fixed positions"
  },
  {
    "id": "2019-08-29-ideas-3",
    "quote": "\"Habits will form whether you want them or not.\n\nWhatever you repeat, you reinforce.\"",
    "intro": "On habit formation",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "James Clear",
    "date": "2019-08-29",
    "section": "Ideas",
    "explanation": "A fundamental truth about habits - they form automatically through repetition, whether intentional or not"
  },
  {
    "id": "2019-08-22-ideas-1",
    "quote": "\"Qualities that lead to increasing intelligence:\n\n1. The curiosity to experiment and explore.\n2. The honesty to observe the world as it is, not as you wish it to be.\n3. The humility to kill your favorite ideas when you learn something new.\n4. The consistency to repeat this cycle for life.\"",
    "intro": "On increasing intelligence",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "James Clear",
    "date": "2019-08-22",
    "section": "Ideas",
    "explanation": "A framework for developing intelligence through curiosity, honesty, humility, and consistent learning cycles"
  },
  {
    "id": "2019-08-22-ideas-2",
    "quote": "\"The most effective networking strategy I've found has nothing to do with conferences, cocktail hours, cold emails, or any of the common ideas you hear.\n\n1) Do interesting things.\n2) Share them publicly.\n\nRepeat those two strategies and you'll become a magnet. Like-minded people will come to you.\"",
    "intro": "On networking",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "James Clear",
    "date": "2019-08-22",
    "section": "Ideas",
    "explanation": "A simple but powerful networking approach focused on creating value and sharing it publicly"
  },
  {
    "id": "2019-08-22-ideas-3",
    "quote": "\"In the long-run (and often in the short-run), your willpower will never beat your environment.\"",
    "intro": "On willpower vs. environment",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "James Clear",
    "date": "2019-08-22",
    "section": "Ideas",
    "explanation": "A reminder that environmental design is more powerful than relying on willpower alone"
  },
  {
    "id": "2019-08-15-ideas-1",
    "quote": "\"Mastery requires both impatience and patience.\n\nThe impatience to have a bias toward action, to not waste time, and to work with a sense of urgency each day.\n\nThe patience to delay gratification, to wait for your actions to accumulate, and to trust the process.\"",
    "intro": "On mastery",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "James Clear",
    "date": "2019-08-15",
    "section": "Ideas",
    "explanation": "A reflection on the dual nature of mastery - requiring both urgency in daily action and patience for long-term results"
  },
  {
    "id": "2019-08-15-ideas-2",
    "quote": "\"When making plans, think big.\n\nWhen making progress, think small.\"",
    "intro": "On planning vs. progress",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "James Clear",
    "date": "2019-08-15",
    "section": "Ideas",
    "explanation": "Strategic advice on balancing big-picture planning with small, incremental progress steps"
  },
  {
    "id": "2019-08-15-ideas-3",
    "quote": "\"A simple strategy that will save you so many headaches: don't care about winning trivial arguments.\n\nDid someone say something you don't agree with? Smile, nod, and move on to more important things.\n\nLife is short. Learning to not care about having the last word will save you so much time.\"",
    "intro": "On avoiding trivial arguments",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "James Clear",
    "date": "2019-08-15",
    "section": "Ideas",
    "explanation": "Practical advice on conserving energy by avoiding unnecessary conflicts and focusing on what truly matters"
  },
  {
    "id": "2019-08-08-ideas-1",
    "quote": "Over 107 billion people have lived throughout history. (There are roughly 7.7 billion people alive right now.)\n\nOver the centuries, these billions of people have tried things, failed, learned, and tried differently. Sometimes, they found new solutions. And when you are born, you get to inherit the insights they learned by trial and error.\n\nThe cumulative lessons of those 107 billion people have been passed down to you. It is the greatest gift you will ever receive. We are smart not because of our individual genius, but because of our collective knowledge.\n\nAs the historian Niall Ferguson noted, \"The dead outnumber the living fourteen to one, and we ignore the accumulated experience of such a huge majority of mankind at our peril.\"",
    "intro": "On the lessons of history",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "A profound perspective on how we inherit the collective wisdom of humanity through history, emphasizing the value of learning from those who came before us"
  },
  {
    "id": "2019-08-08-ideas-2",
    "quote": "\"Life is short.\n\nAnd if life is short, then moving quickly matters. Launch the product. Write the book. Ask the question. Take the chance.\nBe thoughtful, but get moving.\"",
    "intro": "On taking action",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "A call to action emphasizing the importance of moving quickly while remaining thoughtful"
  },
  {
    "id": "2019-08-08-ideas-3",
    "quote": "\"Start now. Optimize later.\n\nAn imperfect start can always be improved, but obsessing over a perfect plan will never take you anywhere on its own.\"",
    "intro": "On imperfect starts",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "James Clear",
    "date": "2019-08-08",
    "section": "Ideas",
    "explanation": "Encouragement to begin with what you have rather than waiting for perfection"
  }
]
