[
  {
    "id": "2019-08-22-quotes-1",
    "quote": "**Tim Grover** was the athletic trainer used by Michael Jordan (and many elite NBA players). Here he is describing the three things he asks of every player:\n\n\"I don't care how much you can lift, how fast you can run, how many pull-ups you can do, or whether you can hit a three while blindfolded. There are only three things I ask of every client… Show up, work hard, and listen. That's it. It requires no talent, no special genetics, or any skill whatsoever to show up, work hard, and listen.\"\n\nHe adds:\n\n\"When I train my athletes, it's a dictatorship with three rules: show up, work hard, and listen. If you can do those three things, I can help you. If you can't we have no use for each other. I will bust my ass for you every way possible, but I expect you to do the same for yourself. I'm not going to work harder than you do for your benefit. Show me you want it, and I'll give it to you.\"",
    "intro": "On the fundamentals of success",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "source_link": "https://www.amazon.com/gp/product/1476714207",
    "author": "Tim Grover",
    "date": "2019-08-22",
    "section": "Quotes",
    "explanation": "Tim Grover's three fundamental requirements for success: showing up, working hard, and listening - skills that require no special talent"
  },
  {
    "id": "2019-08-22-quotes-2",
    "quote": "The author **Ursula K. Le Guin** on shooting for the top:\n\nInterviewer: \"Against whom were you measuring your work?\"\n\nLe Guin: \"Charles Dickens. Jane Austen. And then, when I finally learned to read her, Virginia Woolf. Shoot for the top, always. You know you'll never make it, but what's the fun if you don't shoot for the top?\"",
    "intro": "On shooting for the top",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "source_link": "https://www.theparisreview.org/interviews/6253/the-art-of-fiction-no-221-ursula-k-le-guin",
    "author": "Ursula K. Le Guin",
    "date": "2019-08-22",
    "section": "Quotes",
    "explanation": "Ursula K. Le Guin's philosophy of always aiming for the highest standards, even when you know you may never reach them"
  },
  {
    "id": "2019-08-15-quotes-1",
    "quote": "**Morgan Housel** on bias:\n\n\"Your personal experiences make up maybe 0.00000001% of what's happened in the world but maybe 80% of how you think the world works… We're all biased to our own personal history.\"",
    "intro": "On bias",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "source_link": "https://collabfund.com/blog/ideas-that-changed-my-life/",
    "author": "Morgan Housel",
    "date": "2019-08-15",
    "section": "Quotes",
    "explanation": "Morgan Housel's insight on how our limited personal experiences disproportionately shape our worldview and create bias"
  },
  {
    "id": "2019-08-15-quotes-2",
    "quote": "Housel's quote contrasts nicely with this advice from British writer **Norman Douglas**:\n\n\"There are some things you can't learn from others. You have to pass through the fire.\"",
    "intro": "On learning through experience",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "source_link": "",
    "author": "Norman Douglas",
    "date": "2019-08-15",
    "section": "Quotes",
    "explanation": "Norman Douglas's perspective that certain lessons can only be learned through direct experience and personal challenges"
  },
  {
    "id": "2019-08-08-quotes-1",
    "quote": "**Interviewer:** \"Did you know as a child you wanted to be a writer?\"\n\n**Toni Morrison:** \"No. I wanted to be a reader. I thought everything that needed to be written had already been written or would be. I only wrote the first book because I thought it wasn't there, and I wanted to read it when I got through. I am a pretty good reader. I love it. It is what I do, really. So, if I can read it, that is the highest compliment I can think of. People say, I write for myself, and it sounds so awful and so narcissistic, but in a sense if you know how to read your own work— that is, with the necessary critical distance—it makes you a better writer and editor. When I teach creative writing, I always speak about how you have to learn how to read your work; I don't mean enjoy it because you wrote it. I mean, go away from it, and read it as though it is the first time you've ever seen it. Critique it that way. Don't get all involved in your thrilling sentences and all that…\"\n\nLater in the same interview, she adds:\n\n\"After all, this is my work. I have to take full responsibility for doing it right as well as doing it wrong. Doing it wrong isn't bad, but doing it wrong and thinking you've done it right is.\"",
    "intro": "On critiquing your own work",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "source_link": "https://www.theparisreview.org/interviews/1888/the-art-of-fiction-no-134-toni-morrison",
    "author": "Toni Morrison",
    "date": "2019-08-08",
    "section": "Quotes",
    "explanation": "Toni Morrison's advice on how to critically evaluate your own writing with necessary distance"
  },
  {
    "id": "2019-08-08-quotes-2",
    "quote": "\"It is very difficult to approach Slack with beginner's mind. But we have to, all of us, and we have to do it every day, over and over and polish every rough edge off until this product is as smooth as lacquered mahogany.\n\nEach of you knows 'really good.' Each of you is able to see when things are not done well. Certainly, we all complain enough about other people's software, and we all know how important first impressions are in our own judgments. That is exactly how others will evaluate us.\n\nPutting yourself in the mind of someone who is coming to Slack for the first time — especially a real someone, who is being made to try this thing by their boss, who is already a bit hangry because they didn't have time for breakfast, and who is anxious about finishing off a project before they take off for the long weekend — putting yourself in their mind means looking at Slack the way you look at some random piece of software in which you have no investment and no special interest. Look at it hard, and find the things that do not work.\n\nBe harsh, in the interest of being excellent.\"",
    "intro": "On creating excellent products",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "source_link": "https://medium.com/@stewart/we-dont-sell-saddles-here-4c59524d650d",
    "author": "Stewart Butterfield",
    "date": "2019-08-08",
    "section": "Quotes",
    "explanation": "Stewart Butterfield's memo on the importance of approaching your own work with critical distance and beginner's mind"
  }
]
