[
  {
    "id": "2019-12-19-quotes-1",
    "quote": "Founder of Liberty Media **Peter Barton** on changes sneaking up on you:\n\n\"By increments so exquisitely gradual that they might have passed unnoticed, I could have ended up being totally untrue to myself and living a life I hated.\"",
    "intro": "On gradual changes",
    "newsletter_link": "https://jamesclear.com/3-2-1/december-19-2019",
    "author": "Peter Barton",
    "date": "2019-12-19",
    "section": "Quotes",
    "explanation": "Peter Barton's warning about how small, incremental changes can accumulate unnoticed until you find yourself living a life that's completely at odds with who you really are"
  },
  {
    "id": "2019-12-19-quotes-2",
    "quote": "Writer **Laurie Buchanan** on the behaviors and life we don't choose:\n\n\"Whatever you are not changing, you are choosing.\"",
    "intro": "On choosing through inaction",
    "newsletter_link": "https://jamesclear.com/3-2-1/december-19-2019",
    "author": "Laurie Buchanan",
    "date": "2019-12-19",
    "section": "Quotes",
    "explanation": "Laurie Buchanan's insight that inaction is itself a choice, emphasizing that by not changing something, you're actively choosing to keep it as is"
  },
  {
    "id": "2019-12-12-quotes-1",
    "quote": "An **Indian proverb** on living with purpose:\n\n\"Every time you wake up and ask yourself, 'What good things am I going to do today?' remember that, when the sun goes down at sunset, it will take a part of your life with it.\"",
    "intro": "On living with purpose",
    "newsletter_link": "https://jamesclear.com/3-2-1/december-12-2019",
    "author": "Indian proverb",
    "date": "2019-12-12",
    "section": "Quotes",
    "explanation": "An ancient Indian proverb that emphasizes the urgency of living purposefully, reminding us that each day that passes takes a piece of our life with it"
  },
  {
    "id": "2019-12-12-quotes-2",
    "quote": "Poet and artist **Mary Anne Radmacher** on courage:\n\n\"Courage doesn't always roar. Sometimes courage is a quiet voice at the end of the day saying, 'I will try again tomorrow.'\"",
    "intro": "On quiet courage",
    "newsletter_link": "https://jamesclear.com/3-2-1/december-12-2019",
    "author": "Mary Anne Radmacher",
    "date": "2019-12-12",
    "section": "Quotes",
    "explanation": "Mary Anne Radmacher's insight that courage often manifests as quiet determination and resilience rather than dramatic displays, especially in the commitment to keep trying"
  },
  {
    "id": "2019-12-05-quotes-1",
    "quote": "A line from the **Bhagavad Gita**, the ancient Sanskrit scripture, on focusing on the process rather than the results:\n\n\"You are only entitled to the action, never to its fruits.\"",
    "intro": "On focusing on the process",
    "newsletter_link": "https://jamesclear.com/3-2-1/december-5-2019",
    "author": "Bhagavad Gita",
    "date": "2019-12-05",
    "section": "Quotes",
    "explanation": "Ancient wisdom from the Bhagavad Gita emphasizing that we control our actions but not their outcomes, encouraging focus on the process and effort rather than attachment to results"
  },
  {
    "id": "2019-12-05-quotes-2",
    "quote": "Co-authors, **Rosamund and Benjamin Zander**, on optimism:\n\n\"People who describe the glass as half full are not delusional optimists. In fact, they are more based in reality because they are describing a substance that is actually in the glass. They are describing reality as it is. The cynic who describes the glass as half empty is focusing their energy on something that is not actually there.\"",
    "intro": "On optimism and reality",
    "newsletter_link": "https://jamesclear.com/3-2-1/december-5-2019",
    "author": "Rosamund and Benjamin Zander",
    "date": "2019-12-05",
    "section": "Quotes",
    "explanation": "The Zanders' reframing of optimism as reality-based thinking, showing that focusing on what exists (half full) is more accurate than focusing on what's missing (half empty)"
  },
  {
    "id": "2019-11-28-quotes-1",
    "quote": "**John Bogle**, founder of Vanguard, shares a life lesson:\n\n\"At a party given by a billionaire on Shelter Island, the late Kurt Vonnegut informs his pal, the author Joseph Heller, that their host, a hedge fund manager, had made more money in a single day than Heller had earned from his wildly popular novel Catch 22 over its whole history.\n\n\"Heller responded, 'Yes, but I have something he will never have … Enough.'\"",
    "intro": "On having enough",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-28-2019",
    "author": "John Bogle",
    "date": "2019-11-28",
    "section": "Quotes",
    "explanation": "John Bogle's story about Joseph Heller's response to wealth comparison, emphasizing that true contentment comes from recognizing when you have 'enough' rather than constantly pursuing more"
  },
  {
    "id": "2019-11-28-quotes-2",
    "quote": "The author **Esther Hicks** on living well:\n\n\"If all you did was just looked for things to appreciate, you would live a joyously spectacular life.\"",
    "intro": "On appreciation",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-28-2019",
    "author": "Esther Hicks",
    "date": "2019-11-28",
    "section": "Quotes",
    "explanation": "Esther Hicks' simple but profound insight that focusing on appreciation and gratitude can transform an ordinary life into an extraordinary one"
  },
  {
    "id": "2019-11-21-quotes-1",
    "quote": "Novelist and playwright **Edith Wharton** on being a positive force:\n\n\"There are two ways of spreading light: to be the candle or the mirror that reflects it.\"",
    "intro": "On being a positive force",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-21-2019",
    "author": "Edith Wharton",
    "date": "2019-11-21",
    "section": "Quotes",
    "explanation": "Edith Wharton's metaphor about two ways to contribute positivity - either by being the source of light yourself or by reflecting and amplifying the light of others"
  },
  {
    "id": "2019-11-21-quotes-2",
    "quote": "**John Gardner**, a politician and a recipient of the 1964 Presidential Medal of Freedom, on how to live a meaningful life:\n\n\"Meaning is not something you stumble across, like the answer to a riddle or the prize in a treasure hunt. Meaning is something you build into your life. You build it out of your own past, out of your affections and loyalties, out of the experience of humankind as it is passed on to you, out of your own talent and understanding, out of the things you believe in, out of the things and people you love, out of the values for which you are willing to sacrifice something. The ingredients are there. You are the only one who can put them together into that unique pattern that will be your life. Let it be a life that has dignity and meaning for you. If it does, then the particular balance of success or failure is of less account.\"",
    "intro": "On how to live a meaningful life",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-21-2019",
    "author": "John Gardner",
    "date": "2019-11-21",
    "section": "Quotes",
    "explanation": "John Gardner's comprehensive framework for building meaning in life, emphasizing that it's an active construction process using personal history, relationships, values, and commitments rather than something discovered passively"
  },
  {
    "id": "2019-11-14-quotes-1",
    "quote": "Author **Elizabeth Gilbert** on time management:\n\n\"If you've reached a certain age then you know what works for you. You should know by this point in your life what time of day you're 'good' — like what time of day is your brain at its best. Because the reality is we all get, maybe, two good hours a day where we actually feel awake and alert.\n\n\"And the big, important question is: Who currently gets that time from you. The best time from your brain every day—who or what currently gets that? And would you be willing to take it back so that it's yours and then give the world the 'second-rate' version of you (which is the other 22 hours of the day)…\"",
    "intro": "On time management",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-14-2019",
    "author": "Elizabeth Gilbert",
    "date": "2019-11-14",
    "section": "Quotes",
    "explanation": "Elizabeth Gilbert's insight about protecting your peak mental hours for your most important work, rather than giving your best energy to others and keeping the remainder for yourself"
  },
  {
    "id": "2019-11-14-quotes-2",
    "quote": "The second quote today is from author **Leo Tolstoy**:\n\n\"If you want to do a good deed, do it now. The time will pass, and you will not have the chance again.\"",
    "intro": "On acting now",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-14-2019",
    "author": "Leo Tolstoy",
    "date": "2019-11-14",
    "section": "Quotes",
    "explanation": "Leo Tolstoy's reminder about the urgency of good actions, emphasizing that opportunities to help others or do meaningful things are time-sensitive and shouldn't be delayed"
  },
  {
    "id": "2019-11-07-quotes-1",
    "quote": "**Scott Adams**, author and creator of the Dilbert comic strip, on the price of success:\n\n\"If you want to be successful, find out what the price is and then pay it.\"",
    "intro": "On the price of success",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-7-2019",
    "author": "Scott Adams",
    "date": "2019-11-07",
    "section": "Quotes",
    "explanation": "Scott Adams' straightforward advice that success requires understanding and accepting the necessary costs, rather than trying to avoid them"
  },
  {
    "id": "2019-11-07-quotes-2",
    "quote": "Writer **Rudyard Kipling** also on the price of success:\n\n\"If you don't get what you want, it's a sign either that you did not seriously want it, or that you tried to bargain over the price.\"",
    "intro": "On wanting vs. paying the price",
    "newsletter_link": "https://jamesclear.com/3-2-1/november-7-2019",
    "author": "Rudyard Kipling",
    "date": "2019-11-07",
    "section": "Quotes",
    "explanation": "Rudyard Kipling's insight that failure to achieve goals often stems from either insufficient desire or unwillingness to pay the full price required"
  },
  {
    "id": "2019-10-31-quotes-1",
    "quote": "Widely-respected investor **Charlie Munger** on how to avoid falling victim to intense ideology and unclear thinking:\n\n\"I have what I call an 'iron prescription' that helps me keep sane when I drift toward preferring one intense ideology over another. I feel that I'm not entitled to have an opinion unless I can state the arguments against my position better than the people who are in opposition. I think that I'm qualified to speak only when I've reached that state…\n\n\"That is probably too tough for most people, although I hope it won't ever become too tough for me… This business of not drifting into extreme ideology is very, very important in life. If you want to end up wise, heavy ideology is very likely to prevent that outcome.\"",
    "intro": "On avoiding extreme ideology",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-31-2019",
    "author": "Charlie Munger",
    "date": "2019-10-31",
    "section": "Quotes",
    "explanation": "Charlie Munger's 'iron prescription' for intellectual humility - requiring deep understanding of opposing viewpoints before forming opinions, as a safeguard against ideological extremism"
  },
  {
    "id": "2019-10-31-quotes-2",
    "quote": "Best-selling author **Anne Lamott** on good marriages and good friendships:\n\n\"A good marriage is one in which each spouse secretly thinks he or she got the better deal, and this is true also of our friendships.\"",
    "intro": "On good relationships",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-31-2019",
    "author": "Anne Lamott",
    "date": "2019-10-31",
    "section": "Quotes",
    "explanation": "Anne Lamott's insight that the healthiest relationships are those where both parties feel they're getting more than they're giving, creating mutual appreciation and satisfaction"
  },
  {
    "id": "2019-10-24-quotes-1",
    "quote": "Entrepreneur and investor **Sam Altman** on the importance of focus:\n\n\"Focus is a force multiplier on work. Almost everyone I've ever met would be well-served by spending more time thinking about what to focus on. It is much more important to work on the right thing than it is to work many hours. Most people waste most of their time on stuff that doesn't matter.\n\n\"Once you have figured out what to do, be unstoppable about getting your small handful of priorities accomplished quickly. I have yet to meet a slow-moving person who is very successful.\"",
    "intro": "On the importance of focus",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-24-2019",
    "author": "Sam Altman",
    "date": "2019-10-24",
    "section": "Quotes",
    "explanation": "Sam Altman's insight that focus acts as a force multiplier, emphasizing that working on the right things is more important than working long hours, and that speed of execution matters"
  },
  {
    "id": "2019-10-24-quotes-2",
    "quote": "A quote from Japanese author and Buddhist monk **Yoshida Kenko** way back in 1330(!) on the value of reading books:\n\n\"It is a most wonderful comfort to sit alone beneath a lamp, book spread before you, and commune with someone from the past whom you have never met.\"",
    "intro": "On the value of reading books",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-24-2019",
    "author": "Yoshida Kenko",
    "date": "2019-10-24",
    "section": "Quotes",
    "explanation": "Yoshida Kenko's timeless observation about the intimate connection readers can form with authors across centuries, highlighting the enduring power of books to bridge time and space"
  },
  {
    "id": "2019-10-17-quotes-1",
    "quote": "The first comes from French-Swiss film director **Jean-Luc Godard:**\n\n\"He who jumps into the void owes no explanation to those who stand and watch.\"",
    "intro": "On taking risks",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-17-2019",
    "author": "Jean-Luc Godard",
    "date": "2019-10-17",
    "section": "Quotes",
    "explanation": "Jean-Luc Godard's bold statement about risk-taking, emphasizing that those who take action don't need to justify themselves to passive observers"
  },
  {
    "id": "2019-10-17-quotes-2",
    "quote": "The second is from **Theodore Roosevelt:**\n\n\"It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.\"",
    "intro": "On handling criticism",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-17-2019",
    "author": "Theodore Roosevelt",
    "date": "2019-10-17",
    "section": "Quotes",
    "explanation": "Theodore Roosevelt's famous defense of action over criticism, celebrating those who take risks and make efforts despite the possibility of failure"
  },
  {
    "id": "2019-10-10-quotes-1",
    "quote": "**Maya Angelou** on perseverance and defeat:\n\n\"There is, I hope, a thesis in my work: we may encounter many defeats, but we must not be defeated. That sounds goody-two-shoes, I know, but I believe that a diamond is the result of extreme pressure and time. Less time is crystal. Less than that is coal. Less than that is fossilized leaves. Less than that it's just plain dirt. In all my work, in the movies I write, the lyrics, the poetry, the prose, the essays, I am saying that we may encounter many defeats—maybe it's imperative that we encounter the defeats—but we are much stronger than we appear to be and maybe much better than we allow ourselves to be.\"",
    "intro": "On perseverance and defeat",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-10-2019",
    "author": "Maya Angelou",
    "date": "2019-10-10",
    "section": "Quotes",
    "explanation": "Maya Angelou's profound metaphor comparing human resilience to diamond formation, suggesting that defeats are not only inevitable but necessary for developing our hidden strength and potential"
  },
  {
    "id": "2019-10-10-quotes-2",
    "quote": "**Peter L. Bernstein**, the famous investor, on how to make better decisions when investing and in life:\n\n\"You have to keep reminding yourself: We don't know what's going to happen with anything, ever, over any period. And so it's inevitable that a certain percentage of our decisions will be wrong. There's just no way we can always make the right decision.\n\n\"That doesn't mean you're an idiot. But it does mean you must focus on how serious the consequences could be if you turn out to be wrong: Suppose this doesn't do what I expected it to do—not just because it goes bad, but even if it just doesn't go up enough. What's gonna be the impact on me? If it goes wrong, how wrong could it go and how much will it matter?\n\n\"[This] doesn't mean that you have to be convinced beyond doubt that you are right. But you have to think about the consequences of what you're doing and establish that you can survive them if you're wrong. Consequences are more important than probabilities. This isn't just a paradigm for always coming out with conservative decisions. It's really how you should make decisions, period.\"",
    "intro": "On making better decisions",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-10-2019",
    "author": "Peter L. Bernstein",
    "date": "2019-10-10",
    "section": "Quotes",
    "explanation": "Peter Bernstein's decision-making framework that prioritizes understanding consequences over predicting outcomes, emphasizing risk management and survivability rather than trying to be right every time"
  },
  {
    "id": "2019-10-03-quotes-1",
    "quote": "Italian billionaire **Brunello Cucinelli** on what money can't buy:\n\n\"There are three things you cannot buy.\n\nFitness: You have to keep fit, whether you're rich or not.\n\nDiet: You cannot pay someone to be on a diet for you.\n\n…\n\nThen, looking after your soul. No one can possibly treat your soul but you yourself.\"",
    "intro": "On what money can't buy",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-3-2019",
    "author": "Brunello Cucinelli",
    "date": "2019-10-03",
    "section": "Quotes",
    "explanation": "Brunello Cucinelli's reminder that the most important aspects of life - physical health, dietary discipline, and spiritual well-being - cannot be purchased and require personal effort and commitment"
  },
  {
    "id": "2019-10-03-quotes-2",
    "quote": "The novelist **Jonathan Safran Foer** on changing your habits:\n\n\"Instead of imagining all the meals ahead of you, focus on the meal in front of you. Don't give up burgers for the rest of your life. Just order something different one time. It's hard to change lifelong habits, but it's not that hard to change a meal. Over time, those meals become your new habits.\"",
    "intro": "On changing your habits",
    "newsletter_link": "https://jamesclear.com/3-2-1/october-3-2019",
    "author": "Jonathan Safran Foer",
    "date": "2019-10-03",
    "section": "Quotes",
    "explanation": "Jonathan Safran Foer's practical approach to habit change - focusing on small, manageable decisions in the present moment rather than overwhelming long-term commitments"
  },
  {
    "id": "2019-09-26-quotes-1",
    "quote": "Author and journalist **Anna Quindlen** on being original:\n\n\"…nothing important, or meaningful, or beautiful, or interesting, or great ever came out of imitations. The thing that is really hard, and really amazing, is giving up on being perfect [in the way people expect] and beginning the work of becoming yourself.\n\n\"This is more difficult, because there is no zeitgeist to read, no template to follow, no mask to wear. Set aside what your friends expect, what your parents demand, what your acquaintances require. Set aside the messages this culture sends, through its advertising, its entertainment, its disdain and its disapproval, about how you should behave.\n\n\"Set aside the old traditional notion of female as nurturer and male as leader; set aside, too, the new traditional notions of female as superwoman and male as oppressor. Begin with that most terrifying of all things, a clean slate. Then look, every day, at the choices you are making, and when you ask yourself why you are making them, find this answer: for me, for me. Because they are who and what I am, and mean to be.\n\n…\n\n\"This will always be your struggle whether you are twenty-one or fifty-one. I know this from experience. When I quit the New York Times to be a full-time mother, the voices of the world said that I was nuts. When I quit it again to be a full-time novelist, they said I was nuts again. But I am not nuts. I am happy. I am successful on my own terms. Because if your success is not on your own terms, if it looks good to the world but does not feel good in your heart, it is not success at all.\"",
    "intro": "On being original",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-26-2019",
    "author": "Anna Quindlen",
    "date": "2019-09-26",
    "section": "Quotes",
    "explanation": "Anna Quindlen's powerful message about authenticity and defining success on your own terms rather than conforming to external expectations"
  },
  {
    "id": "2019-09-26-quotes-2",
    "quote": "**John Gardner** on failure:\n\n\"Everyone fails. [The professional boxer and world heavyweight champion] Joe Louis said 'Everyone has to figure to get beat some time.' The question isn't did you fail, but did you pick yourself up and move ahead?\n\n\"And there is one other little question: Did you collaborate in your own defeat? A lot of people do. Learn not to.\"",
    "intro": "On failure",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-26-2019",
    "author": "John Gardner",
    "date": "2019-09-26",
    "section": "Quotes",
    "explanation": "John Gardner's insight that failure is universal, but the key questions are whether you persevere and whether you're unconsciously contributing to your own setbacks"
  },
  {
    "id": "2019-09-12-quotes-1",
    "quote": "\"The best — maybe the only? — real, direct measure of 'innovation' is change in human behaviour. In fact, it is useful to take this way of thinking as definitional: innovation is the sum of change across the whole system, not a thing which causes a change in how people behave. No small innovation ever caused a large shift in how people spend their time and no large one has ever failed to do so.\"",
    "intro": "On the true definition of innovation",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-12-2019",
    "author": "Stewart Butterfield",
    "date": "2019-09-12",
    "section": "Quotes",
    "explanation": "Butterfield's insight that innovation should be measured by its impact on human behavior, not by the technology itself"
  },
  {
    "id": "2019-09-12-quotes-2",
    "quote": "\"[If you want to guarantee a life of misery], be unreliable. Do not faithfully do what you have engaged to do. If you will only master this one habit you will more than counterbalance the combined effect of all your virtues, howsoever great. If you like being distrusted and excluded from the best human contribution and company, this prescription is for you. Master this one habit and you can always play the role of the hare in the fable, except that instead of being outrun by one fine turtle you will be outrun by hordes and hordes of mediocre turtles and even by some mediocre turtles on crutches.\n\nI must warn you that if you [do the opposite] it may be hard to end up miserable, even if you start disadvantaged. I had a roommate in college who was and is severely dyslexic. But he is perhaps the most reliable man I have ever known. He has had a wonderful life so far, outstanding wife and children, chief executive of a multibillion dollar corporation. …you simply can't count on your other handicaps to hold you back if you persist in being reliable.\"",
    "intro": "On the importance of being reliable",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-12-2019",
    "author": "Charlie Munger",
    "date": "2019-09-12",
    "section": "Quotes",
    "explanation": "Munger's inverse wisdom showing that reliability is so powerful it can overcome almost any other disadvantage"
  },
  {
    "id": "2019-09-05-quotes-1",
    "quote": "\"Optimism is unfashionable today, particularly among intellectuals. Everyone makes fun of it. Someone said, 'Pessimists got that way by financing optimists.' But I am not pessimistic and I advise you not to be.\n\n…a tough-minded optimism is best. The future is not shaped by people who don't really believe in the future. Men and women of vitality have always been prepared to bet their futures, even their lives, on ventures of unknown outcome. If they had all looked before they leaped, we would still be crouched in caves sketching animal pictures on the wall.\n\nBut I did say tough-minded optimism. High hopes that are dashed by the first failure are precisely what we don't need. We have to believe in ourselves, but we mustn't suppose that the path will be easy, it's tough. Life is painful, and rain falls on the just, and Mr. Churchill was not being a pessimist when he said 'I have nothing to offer, but blood, toil, tears and sweat.' He had a great deal more to offer, but as a good leader he was saying it wasn't going to be easy, and he was also saying something that all great leaders say constantly — that failure is simply a reason to strengthen resolve.\"",
    "intro": "On tough-minded optimism",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-5-2019",
    "author": "John W. Gardner",
    "date": "2019-09-05",
    "section": "Quotes",
    "explanation": "Gardner's vision of resilient optimism that acknowledges difficulty while maintaining belief in the future"
  },
  {
    "id": "2019-09-05-quotes-2",
    "quote": "\"[Courage is] the most important of all the virtues. Without that virtue you can't practice any other virtue with consistency.\"",
    "intro": "On the primacy of courage",
    "newsletter_link": "https://jamesclear.com/3-2-1/september-5-2019",
    "author": "Maya Angelou",
    "date": "2019-09-05",
    "section": "Quotes",
    "explanation": "Angelou's insight that courage is the foundation that enables all other virtues to be practiced consistently"
  },
  {
    "id": "2019-08-29-quotes-1",
    "quote": "\"Life is not a dress rehearsal—this is probably it. Make it count.\n\nTime is extremely limited and goes by fast. Do what makes you happy and fulfilled—few people get remembered hundreds of years after they die anyway. Don't do stuff that doesn't make you happy (this happens most often when other people want you to do something). Don't spend time trying to maintain relationships with people you don't like, and cut negative people out of your life…\n\nThe days are long but the decades are short.\"",
    "intro": "On making the most of your one life",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "Sam Altman",
    "date": "2019-08-29",
    "section": "Quotes",
    "explanation": "Sam Altman's reflection on the importance of living intentionally and making choices that align with personal happiness and fulfillment"
  },
  {
    "id": "2019-08-29-quotes-2",
    "quote": "\"Life is short, but life is also long. You have to live with your choices.\"",
    "intro": "On living with your choices",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-29-2019",
    "author": "Friend's grandmother",
    "date": "2019-08-29",
    "section": "Quotes",
    "explanation": "A paradoxical wisdom that reminds us to consider both the urgency and the long-term consequences of our decisions"
  },
  {
    "id": "2019-08-22-quotes-1",
    "quote": "**Tim Grover** was the athletic trainer used by Michael Jordan (and many elite NBA players). Here he is describing the three things he asks of every player:\n\n\"I don't care how much you can lift, how fast you can run, how many pull-ups you can do, or whether you can hit a three while blindfolded. There are only three things I ask of every client… Show up, work hard, and listen. That's it. It requires no talent, no special genetics, or any skill whatsoever to show up, work hard, and listen.\"\n\nHe adds:\n\n\"When I train my athletes, it's a dictatorship with three rules: show up, work hard, and listen. If you can do those three things, I can help you. If you can't we have no use for each other. I will bust my ass for you every way possible, but I expect you to do the same for yourself. I'm not going to work harder than you do for your benefit. Show me you want it, and I'll give it to you.\"",
    "intro": "On the fundamentals of success",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "Tim Grover",
    "date": "2019-08-22",
    "section": "Quotes",
    "explanation": "Tim Grover's three fundamental requirements for success: showing up, working hard, and listening - skills that require no special talent"
  },
  {
    "id": "2019-08-22-quotes-2",
    "quote": "The author **Ursula K. Le Guin** on shooting for the top:\n\nInterviewer: \"Against whom were you measuring your work?\"\n\nLe Guin: \"Charles Dickens. Jane Austen. And then, when I finally learned to read her, Virginia Woolf. Shoot for the top, always. You know you'll never make it, but what's the fun if you don't shoot for the top?\"",
    "intro": "On shooting for the top",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-22-2019",
    "author": "Ursula K. Le Guin",
    "date": "2019-08-22",
    "section": "Quotes",
    "explanation": "Ursula K. Le Guin's philosophy of always aiming for the highest standards, even when you know you may never reach them"
  },
  {
    "id": "2019-08-15-quotes-1",
    "quote": "**Morgan Housel** on bias:\n\n\"Your personal experiences make up maybe 0.00000001% of what's happened in the world but maybe 80% of how you think the world works… We're all biased to our own personal history.\"",
    "intro": "On bias",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "Morgan Housel",
    "date": "2019-08-15",
    "section": "Quotes",
    "explanation": "Morgan Housel's insight on how our limited personal experiences disproportionately shape our worldview and create bias"
  },
  {
    "id": "2019-08-15-quotes-2",
    "quote": "Housel's quote contrasts nicely with this advice from British writer **Norman Douglas**:\n\n\"There are some things you can't learn from others. You have to pass through the fire.\"",
    "intro": "On learning through experience",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-15-2019",
    "author": "Norman Douglas",
    "date": "2019-08-15",
    "section": "Quotes",
    "explanation": "Norman Douglas's perspective that certain lessons can only be learned through direct experience and personal challenges"
  },
  {
    "id": "2019-08-08-quotes-1",
    "quote": "**Interviewer:** \"Did you know as a child you wanted to be a writer?\"\n\n**Toni Morrison:** \"No. I wanted to be a reader. I thought everything that needed to be written had already been written or would be. I only wrote the first book because I thought it wasn't there, and I wanted to read it when I got through. I am a pretty good reader. I love it. It is what I do, really. So, if I can read it, that is the highest compliment I can think of. People say, I write for myself, and it sounds so awful and so narcissistic, but in a sense if you know how to read your own work— that is, with the necessary critical distance—it makes you a better writer and editor. When I teach creative writing, I always speak about how you have to learn how to read your work; I don't mean enjoy it because you wrote it. I mean, go away from it, and read it as though it is the first time you've ever seen it. Critique it that way. Don't get all involved in your thrilling sentences and all that…\"\n\nLater in the same interview, she adds:\n\n\"After all, this is my work. I have to take full responsibility for doing it right as well as doing it wrong. Doing it wrong isn't bad, but doing it wrong and thinking you've done it right is.\"",
    "intro": "On critiquing your own work",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "Toni Morrison",
    "date": "2019-08-08",
    "section": "Quotes",
    "explanation": "Toni Morrison's advice on how to critically evaluate your own writing with necessary distance"
  },
  {
    "id": "2019-08-08-quotes-2",
    "quote": "\"It is very difficult to approach Slack with beginner's mind. But we have to, all of us, and we have to do it every day, over and over and polish every rough edge off until this product is as smooth as lacquered mahogany.\n\nEach of you knows 'really good.' Each of you is able to see when things are not done well. Certainly, we all complain enough about other people's software, and we all know how important first impressions are in our own judgments. That is exactly how others will evaluate us.\n\nPutting yourself in the mind of someone who is coming to Slack for the first time — especially a real someone, who is being made to try this thing by their boss, who is already a bit hangry because they didn't have time for breakfast, and who is anxious about finishing off a project before they take off for the long weekend — putting yourself in their mind means looking at Slack the way you look at some random piece of software in which you have no investment and no special interest. Look at it hard, and find the things that do not work.\n\nBe harsh, in the interest of being excellent.\"",
    "intro": "On creating excellent products",
    "newsletter_link": "https://jamesclear.com/3-2-1/august-8-2019",
    "author": "Stewart Butterfield",
    "date": "2019-08-08",
    "section": "Quotes",
    "explanation": "Stewart Butterfield's memo on the importance of approaching your own work with critical distance and beginner's mind"
  }
]
